app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		#rails will pass the instance variable article to the View
		@articles = Article.find(params[:id])

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-20 06:43:11.348023"], ["text", "you"], ["title", "hey"], ["updated_at", "2015-02-20 06:43:11.348023"]]
---
	def create
		#render plain: params[:article].inspect
		@article = Article.new(article_params)
		#@article = Article.new(params.require(:article).permit(:title,:text))

		# #to save the model in db
		# @article.save
		# #the following line redirect it to the show action
		# redirect_to @article

		if @article.save